public class Test17 { 
    public static void main(String[] args){ 
        int a = 1; 
        // loop for คือ loop ที่มีรอบตายตัว
       //for ต้องประกาศค่าตัวแปร และกำหนดขอบเขต 
       //for ถ้าหากไม่ถึงขอบเขตจะทำให้เป็น loop Infinity
         // ++ คือค่าเพิ่มขึ้น 1
         for(int i = 0;i<=1000;i++) //ถ้าจริงจะวนซ้ำ //เช็คก่อน
         {
            System.out.println(a +" " + i);
            a=a*2;
         }

    }
    // ค่า int เก็บได้ถึง +- 2^31  
    //ค่า long เก็บได้ถึง +- 2^61
    //ค่า float เก็บได้ถึง 2^127 แต่เป็นตัวย่อ ได้ค่า Infinity ที่ 2^128++ เป็นทศนิยม
    //ค่า double เก็บได้ถึง 2^1023 แต่เป็นตัวย่อ ได้ค่า Infinity ที่ 2^1024++ เป็นทศนิยม


}